Revit 2015 API
TableSectionData.SetMergedCell Method
 Sets the merged cell that this cell is a part of.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public void SetMergedCell(
	int nRow,
	int nCol,
	TableMergedCell mergedCell
)
Visual Basic
Public Sub SetMergedCell ( _
	nRow As Integer, _
	nCol As Integer, _
	mergedCell As TableMergedCell _
)
Visual C++
public:
void SetMergedCell(
	int nRow,
	int nCol,
	TableMergedCell^ mergedCell
)
Parameters
nRow
Type: System.Int32
nCol
Type: System.Int32
mergedCell
Type: Autodesk.Revit.DB.TableMergedCell
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The given row number nRow is invalid. -or- The given column number nCol is invalid.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
Autodesk.Revit.Exceptions.InvalidOperationException |  This operation is forbidden for cells in standard schedule body sections.
See Also
TableSectionData Class
Autodesk.Revit.DB Namespace